def f21(x):
    if x[0] == 1964:

        if x[1] == 'ats':
            if x[2] == 'grace':
                return 0
            elif x[2] == 'haxe':
                return 1

        elif x[1] == 'io':
            return 2

        elif x[1] == 'antlr':
            if x[4] == 1999:
                if x[3] == 2019:
                    return 3
                elif x[3] == 1994:
                    return 4
            elif x[4] == 1986:
                return 5

    elif x[0] == 1972:
        if x[1] == 'ats':
            return 6
        elif x[1] == 'io':
            if x[4] == 1999:
                return 7
            elif x[4] == 1986:
                if x[2] == 'grace':
                    return 8
                elif x[2] == 'haxe':
                    return 9
        elif x[1] == 'antlr':
            return 10

    elif x[0] == 2011:
        return 11


def f22(code):
    g = (code & ((2 ** 32 - 1) & ~(2 ** 31 - 1)))
    f = (code & ((2 ** 31 - 1) & ~(2 ** 30 - 1))) >> 4
    e = (code & ((2 ** 30 - 1) & ~(2 ** 26 - 1))) >> 5
    d = (code & ((2 ** 26 - 1) & ~(2 ** 14 - 1))) >> 14
    c = (code & ((2 ** 14 - 1) & ~(2 ** 10 - 1))) << 17
    b = (code & ((2 ** 10 - 1) & ~(2 ** 9 - 1))) << 16
    a = (code & (2 ** 9 - 1)) << 12
    return g | c | f | b | e | a | d


def f23(table):
    newTable = []
    newRow = []
    for row in table:
        for element in row:
            if element is not None:
                element = str(element)
                if '+' in element:
                    newRow.append(element[4:7] + '-' + element[9:12] + '-' + element[13:15] + element[16:18])
                if '%' in element:
                    if float(element.replace('%', '')[0:2]) / 100 < 0.1:
                        newRow.append('0.0' + element.replace('%', '')[0:2])
                    else:
                        newRow.append('0.' + element.replace('%', '')[0:2])
                if '@' in element:
                    newRow.append(element.split('@')[1].lstrip().split('!')[0])
                if '!' in element:
                    newRow.append(element.split('!')[1].lstrip().split(' ')[1])
        if len(newRow) > 0:
            newTable.append(newRow)
            newRow = []

    newTable2 = []
    for row in newTable:
        if row not in newTable2:
            newTable2.append(row)
            transp = [list(i) for i in zip(*newTable2)]
            result = [transp[0], transp[1], transp[2], transp[3]]
    return result


print(f23([['+7 (973) 661-78-58', '42%', 'zodman34@gmail.com!Антон Зодман'],
           ['+7 (835) 213-51-25', '99%', 'zuvigidi37@mail.ru!Тихон Цувигиди'],
           ['+7 (835) 213-51-25', '99%', 'zuvigidi37@mail.ru!Тихон Цувигиди'],
           ['+7 (691) 917-76-97', '33%', 'stanislav47@yandex.ru!Станислав Кутко'],
           ['+7 (849) 711-09-72', '95%', 'rustam68@yahoo.com!Рустам Шукиди'],
           ['+7 (835) 213-51-25', '99%', 'zuvigidi37@mail.ru!Тихон Цувигиди']]) ==

      [['973-661-7858', '835-213-5125', '691-917-7697', '849-711-0972'],
       ['0.42', '0.99', '0.33', '0.95'],
       ['gmail.com', 'mail.ru', 'yandex.ru', 'yahoo.com'],
       ['Зодман', 'Цувигиди', 'Кутко', 'Шукиди']])

print(f23([['+7 (044) 184-95-56', '98%', 'gofonij91@yahoo.com!Глеб Гофоний'],
           ['+7 (044) 184-95-56', '98%', 'gofonij91@yahoo.com!Глеб Гофоний'],
           ['+7 (930) 311-52-33', '69%', 'rosananz64@yandex.ru!Валерий Рошанянц'],
           ['+7 (722) 945-86-23', '30%', 'al_bert29@yahoo.com!Альберт Зибянц'],
           ['+7 (044) 184-95-56', '98%', 'gofonij91@yahoo.com!Глеб Гофоний']]) ==

      [['044-184-9556', '930-311-5233', '722-945-8623'],
       ['0.98', '0.69', '0.30'],
       ['yahoo.com', 'yandex.ru', 'yahoo.com'],
       ['Гофоний', 'Рошанянц', 'Зибянц']])

print(f23([['+7 (881) 158-76-20', '59%', 'elisej98@gmail.com!Елисей Шиниди'],
           ['+7 (713) 316-45-77', '55%', 'cetizic96@mail.ru!Герман Четизич'],
           ['+7 (745) 658-03-32', '16%', 'fodanz84@mail.ru!Дамир Фодянц'],
           ['+7 (745) 658-03-32', '16%', 'fodanz84@mail.ru!Дамир Фодянц'],
           ['+7 (745) 658-03-32', '16%', 'fodanz84@mail.ru!Дамир Фодянц']]) ==

      [['881-158-7620', '713-316-4577', '745-658-0332'],
       ['0.59', '0.55', '0.16'],
       ['gmail.com', 'mail.ru', 'mail.ru'],
       ['Шиниди', 'Четизич', 'Фодянц']])

print(f23([['+7 (974) 347-22-81', '55%', 'andrej41@rambler.ru!Андрей Кабянц'],
           ['+7 (974) 347-22-81', '55%', 'andrej41@rambler.ru!Андрей Кабянц'],
           ['+7 (974) 347-22-81', '55%', 'andrej41@rambler.ru!Андрей Кабянц'],
           ['+7 (931) 478-44-18', '78%', 'svatoslav96@gmail.com!Святослав Ривин'],
           ['+7 (726) 843-14-29', '9%', 'igor_2@yandex.ru!Игорь Ручак'],
           ['+7 (468) 546-89-45', '11%', 'nilesuk70@gmail.com!Олег Нилешук']]) ==

      [['974-347-2281', '931-478-4418', '726-843-1429', '468-546-8945'],
       ['0.55', '0.78', '0.09', '0.11'],
       ['rambler.ru', 'gmail.com', 'yandex.ru', 'gmail.com'],
       ['Кабянц', 'Ривин', 'Ручак', 'Нилешук']])

print(f23([['+7 (116) 286-29-55', '83%', 'stanislav28@yahoo.com!Станислав Шечадий'],
           ['+7 (485) 118-28-37', '83%', 'cumak46@rambler.ru!Марк Чумак'],
           ['+7 (924) 753-54-93', '1%', 'andrej49@yandex.ru!Андрей Дакев'],
           ['+7 (485) 118-28-37', '83%', 'cumak46@rambler.ru!Марк Чумак'],
           ['+7 (485) 118-28-37', '83%', 'cumak46@rambler.ru!Марк Чумак'],
           ['+7 (829) 380-09-32', '32%', 'aleksej11@yandex.ru!Алексей Родотли']]) ==

      [['116-286-2955', '485-118-2837', '924-753-5493', '829-380-0932'],
       ['0.83', '0.83', '0.01', '0.32'],
       ['yahoo.com', 'rambler.ru', 'yandex.ru', 'yandex.ru'],
       ['Шечадий', 'Чумак', 'Дакев', 'Родотли']])

print(f23([['+7 (921) 759-44-02', '54%', 'nozisberg80@gmail.com!Валерий Ноцишберг'],
           ['+7 (921) 759-44-02', '54%', 'nozisberg80@gmail.com!Валерий Ноцишберг'],
           ['+7 (921) 759-44-02', '54%', 'nozisberg80@gmail.com!Валерий Ноцишберг'],
           ['+7 (864) 604-96-87', '79%', 'zadomij46@yandex.ru!Филипп Задомий'],
           ['+7 (073) 665-86-93', '51%', 'evgenij81@gmail.com!Евгений Лавман']]) ==

      [['921-759-4402', '864-604-9687', '073-665-8693'],
       ['0.54', '0.79', '0.51'],
       ['gmail.com', 'yandex.ru', 'gmail.com'],
       ['Ноцишберг', 'Задомий', 'Лавман']])

print(f23([['+7 (417) 861-65-02', '66%', 'miroslav10@yahoo.com!Мирослав Данев'],
           ['+7 (417) 861-65-02', '66%', 'miroslav10@yahoo.com!Мирослав Данев'],
           ['+7 (879) 836-30-16', '86%', 'vamberg86@rambler.ru!Филипп Вамберг'],
           ['+7 (707) 272-79-87', '34%', 'valerij17@yandex.ru!Валерий Линов'],
           ['+7 (417) 861-65-02', '66%', 'miroslav10@yahoo.com!Мирослав Данев'],
           ['+7 (207) 722-08-74', '93%', 'rostislav8@yahoo.com!Ростислав Лукекяк']]) ==

      [['417-861-6502', '879-836-3016', '707-272-7987', '207-722-0874'],
       ['0.66', '0.86', '0.34', '0.93'],
       ['yahoo.com', 'rambler.ru', 'yandex.ru', 'yahoo.com'],
       ['Данев', 'Вамберг', 'Линов', 'Лукекяк']])

print(f23([['+7 (052) 935-68-50', '40%', 'labemak37@yahoo.com!Ян Лабемяк'],
           ['+7 (273) 695-90-43', '57%', 'tamerlan17@gmail.com!Тамерлан Фунский'],
           ['+7 (273) 695-90-43', '57%', 'tamerlan17@gmail.com!Тамерлан Фунский'],
           ['+7 (055) 048-67-09', '52%', 'rabogan25@rambler.ru!Эмиль Рабогян'],
           ['+7 (598) 036-18-86', '10%', 'elisej29@yahoo.com!Елисей Рушман'],
           ['+7 (273) 695-90-43', '57%', 'tamerlan17@gmail.com!Тамерлан Фунский']]) ==

      [['052-935-6850', '273-695-9043', '055-048-6709', '598-036-1886'],
       ['0.40', '0.57', '0.52', '0.10'],
       ['yahoo.com', 'gmail.com', 'rambler.ru', 'yahoo.com'],
       ['Лабемяк', 'Фунский', 'Рабогян', 'Рушман']])
